{
    "unit_number": "01",
    "unit_name": "THE NATURE OF IT PROJECTS",
    "unit_code": "PN0000-0102.Pk02.U01",
    "unit_revision": "A.01",
    "unit_languages": ["EN"],
    "unit_learn_modes": ["self study", "remote classrom", "guided offline"],
    "prequisites": "Generalities about projects",
    "available_formats": ["PDF", "SCORM", "hard copy", "scheduled coaching and review meetings"],
    "orderable": true,
    "price_unit_price": 18.99,
    "price_currency": "EUR",
    "unit_sections": [
        {
            "section_number": 1,
            "section_name": "what are IT projects",
            "section_brief": "The projects in IT industry, ... patterns as any other projects. Basically, they are dealing with ... as any other projects. What makes them 'special', why the failure rate is bigger than in other engineering projects, why some people avoid this kind of projects..., all of these happens because ..."
        },
        {
            "section_number": 2,
            "section_name": "the problem of quantifying software things",
            "section_brief": "The problem with quantifying software resides in the fact that IT IS NOT A PHYSICAL THING...Actual system (and probably for a long time) the actual method is based on licensing..."
        },
        {
            "section_number": 3,
            "section_name": "what are software licenses",
            "section_brief": "There are different kinds of license types, mostly used being:... License per different volumes ..."
        },
        {
            "section_number": 4,
            "section_name": "what are bugs and when to consider as being a bug",
            "section_brief": "Another problem in software is the term ‘bug’ which sounds like something known but there are more opinions of what exactly means this being an interpretability ‘open gateway’ as large as possible. Sometimes and often the term is used as an equivalent for ‘something that I do not like’ and being that in software objectives are not enough well definable (i.e., SMART), it can be a malicious practice to deny what some persons do not like or agree..."
        },
        {
            "section_number": 5,
            "section_name": "teams, software developers, testers, technical writers and other people",
            "section_brief": "From this point of view, there are some usual specializations that are related to software development process. From your point of view would be good to understand what are these good for and why are they needed..."
        },
        {
            "section_number": 6,
            "section_name": "software taxonomies",
            "section_brief": "Software taxonomies are important to you to understand complexity and potential implications of resulted system. Software systems and application could be categorized by different point of views not necessarily exclusive. So some of the most used taxonomies are:..."
        },
        {
            "section_number": 7,
            "section_name": "legal and ethical issues",
            "section_brief": "... What you need to understand is that a developer can include some malicious code in applications without your permission and without inform you about this ..."
        }
    ],
    "unit_actions": [
        {
            "action_url_operation": "dwnld_sample",
            "action_name": "Download sample",
            "action_url_or_file": "PN0000-0102.Pk02.U01-A.01-EN.s.pdf",
            "action_tooltip": "Sample, watermarked and non-printable document version"
        },
        {
            "action_url_operation": "dwnld_full",
            "action_name": "Download full",
            "action_url_or_file": "PN0000-0102.Pk02.U01-A.01-EN.f.pdf",
            "action_tooltip": "Full document version, protected with purchased access key"
        },
        {
            "action_url_operation": "play_scorm",
            "action_name": "Play SCORM",
            "action_url_or_file": "PN0000-0102.Pk02.U01-A.01-EN.f.SCORM",
            "action_tooltip": "Play unit as SCORM in platform (available soon)"
        }
    ]
}